# запишем все буквы англ. алфавита
letters = 'abcdefghijklmnopqrstuvwxyz'

# тут храним все созданные имена переменных
vars_list = []

# счетчик, чтобы присвоить всем переменным значения от 1 до 2600
cnt = 1

# внешний цикл по буквам a-z
for i in letters:
    # внутренний цикл по числам от 0 до 99
    for j in range(100):
        # формирование имени переменной
        var_name = i + str(j)

        # добавление переменной в словарь переменных
        vars()[var_name] = cnt
        cnt += 1

        # добавление имени переменной в список
        vars_list.append(var_name)


# тут будет отслеживать сколько не попало в словарь
not_found = 0

for v in vars_list:
    # если переменная с таким именем не в словаре, увеличиваем счетчик
    if v not in vars_list:
        not_found += 1

print(f"Создано переменных: {len(vars_list)}, а не попало в словарь: {not_found}")

