print("===========================================================")
print("Смотрим строки")
print("===========================================================")
a = "Hello World"
b1 = a
b2 = a[:]
print(f"a: {a}, id: {id(a)}")
print(f"b1: {b1}, id: {id(b1)}")
print(f"b2: {b2}, id: {id(b2)}")

print("\n")
print("===========================================================")
print("Смотрим Списки")
print("===========================================================")
a = [1, 2, 3]
b1 = a
b2 = a[:]

print(f"a: {a}, id: {id(a)}")
print(f"b1: {b1}, id: {id(b1)}")
print(f"b2: {b2}, id: {id(b2)}")

a[0] = 10
print(f"a: {a}")
print(f"b1: {b1}")
print(f"b2: {b2}")